[
    {
        "id": "video_00001",
        "title": "The Midnight Subscriber: My Biggest Fan is Always Watching",
        "content": "It started as a fluke, a happy accident. I created \"Chilling Tales,\" a YouTube channel for my scary stories, as a creative outlet. For six months, it was a ghost town. Then, I got my first consistent viewer: **user78412_.\n\nHe—I assumed it was a he—was my sole, loyal audience. No matter when I uploaded, whether it was 7 PM on a Tuesday or 2 PM on a Saturday, his comment was always the first. Always the same: \"First! Another great one.\" It was comforting. My digital patron saint.\n\nThe pattern shifted about a month ago. The comments started appearing not just quickly, but instantly. I'd hit \"publish,\" refresh the page, and there it was. \"First!\" I laughed it off, assuming he had notifications set to \"all\" and was just that dedicated.\n\nThen came the insomnia. The 3 AM wake-ups, mind racing, staring at the ceiling. One of those nights, an idea, dark and twisted, flowed out of me. I wrote, recorded, and edited a short, raw story about a man who felt a presence in his home every night at 3:33 AM. On a whim, I uploaded it. The timestamp read 3:33 AM.\n\nI leaned back, rubbing my eyes, the silence of the house pressing in. I clicked refresh on the video page, expecting nothing. A glitch. A zero in the comment section.\n\nBut there it was. A comment from **user78412_, posted just 10 seconds after the video went live.\n\nMy blood went cold. It was impossible. No one is that fast.\n\nI clicked on it. The comment wasn't \"First!\" this time.\n\nIt read: \"I'm so glad you're finally awake. I can see you much better now.\"\n\nA jolt of pure ice shot down my spine. My eyes darted from my phone screen to the dark hallway beyond my bedroom door. It was a joke. It had to be. A sick, coincidental joke.\n\nI slammed my laptop shut, my heart hammering against my ribs like a trapped bird. I told myself I was being paranoid, spooked by my own story. I spent the rest of the night with the lights on, jumping at every creak of the old house.\n\nThe next morning, in the safe, rational light of day, I checked the comment again. Maybe I had misread it. But it was still there, digital proof of the impossible.\n\nI clicked on **user78412_'s profile. It was empty, save for a single, unlisted playlist. My hand trembled as I clicked it.\n\nThe playlist was titled \"For You.\" It contained every video I had ever posted, but the thumbnails were different. They weren't screenshots from my videos. They were photos. Blurry, dark, but unmistakable.\n\nA photo of me at my desk, taken from outside my window.\nA photo of the back of my head in a coffee shop last week.\nThe final video in the playlist was uploaded just an hour ago. The thumbnail was a live feed.\n\nIt was a view of my own bedroom, from the corner near the closet. And in the bed, bathed in the blue glow of my phone, was me, staring back in wide-eyed horror.",
        "video": "https://youtube.com/shorts/tpgQLBVHiDU?feature=share"
    },
    {
        "id": "video_00002",
        "title": "My Baby Monitor Whispered Back | A True Horror Story",
        "content": "It started with the laughter.\n\nMy wife, Sarah, and I laughed it off at first. 'It's just static,' I'd say, 'or a signal from a neighbor's monitor.' We were new parents, exhausted and prone to hearing things. But the sound that came through the baby monitor every night around 2 AM wasn't static. It was the distinct, gurgling giggle of a toddler. Our daughter, Lily, was only six months old. She didn't laugh like that yet. She certainly didn't do it in her sleep.\n\nWe’d rush into her room, our hearts thumping, only to find her peacefully asleep, her chest rising and falling in a perfect, innocent rhythm. The monitor on our nightstand, however, would continue to pick up the soft laughter, sometimes followed by a faint, rhythmic shuffling, like tiny feet on the crib mattress.\n\nWe changed the monitor. We changed the frequency. Nothing worked. The laughter was just… there.\n\nThe dread became a third occupant in our house, a cold presence that settled in as the sun went down. We stopped talking about it. Acknowledging it felt like giving it power.\n\nThen, last night, everything changed.\n\nI was jolted awake not by laughter, but by a deafening silence. The monitor was dead quiet. No static, no ambient room noise. Just a void. I squinted at the video feed. The night-vision glow showed Lily, still asleep.\n\nThen, a shadow detached itself from the corner of the room, a deeper blackness in the dark. It was tall, impossibly so, and thin. It didn't walk so much as it *unfolded* itself toward the crib. My blood turned to ice. I tried to scream, to move, but I was paralyzed, locked in a nightmare while wide awake.\n\nThe figure leaned over the crib, its head tilting. And from the monitor, the laughter returned, but this time it was low, wet, and cruel.\n\nThe figure straightened up. And then, it turned. It didn't have a face, just a smooth, pale oval where features should be. It was looking directly at the camera. At *me*.\n\nOn the screen, my sleeping daughter suddenly sat bolt upright. Her eyes were wide open, black and depthless in the green light. She turned her head, not toward the figure, but directly into the lens of the monitor.\n\nThe monitor speaker crackled, and a voice that was not a child's, a voice that was ancient and rasping and wrong, whispered clearly:\n\n'Shhh, you'll wake the other one.'\n\nThe screen went black.\n\nI found myself in Lily's room, I don't even remember moving. I was clutching her, sobbing, as Sarah flicked on the light. The room was empty. Lily was fine, crying now from being woken so abruptly.\n\nWe both told ourselves it was a shared nightmare, a hallucination born of sleep deprivation. We almost believed it.\n\nUntil this morning.\n\nI was getting ready for work, my hands still shaking, when I passed the nursery. The door was ajar. I glanced in, and my heart stopped.\n\nIn the far corner of the room, the one where the shadow had first appeared, sat Lily’s favorite stuffed rabbit. It was propped up against the wall. And tucked under its arm was a second, identical stuffed rabbit. One we had never owned before.",
        "video": "https://youtube.com/shorts/Ziaq38ubC3A?feature=share"
    },
    {
        "id": "video_00003",
        "title": "The Doppelgänger Diary: I Found a Journal Entry I Didn't Write",
        "content": "I started the journal to quiet the noise in my head. My therapist suggested it for my anxiety—a place to dump all the circling thoughts so I could finally sleep. I bought a simple, black Moleskine. It felt solid, real. An anchor in the fog of my own mind.\n\nThe first week was cathartic. I wrote about work stress, about an awkward conversation with a neighbor, about my fear that my life was plateauing. It was mundane, but it was mine.\n\nThe first strange entry appeared on a Tuesday.\n\nI opened the journal to a fresh page, and my breath hitched. There, in my own unmistakable handwriting, was a detailed account of my previous day.\n\n\"Monday. Cloudy. Went to work, came home, ordered Thai food. The Panang curry was too sweet. Watched two episodes of that detective show, the one where you guessed the killer in the first ten minutes. You felt bored. You went to bed at 11:07 PM.\"\n\nIt was all correct. Eerily so. But I had no memory of writing it. I convinced myself I must have been half-asleep, just disoriented from the new routine. I shook it off, wrote my actual entry for the day, and tried to forget.\n\nBut it happened again the next week. And the week after that. Each time, the entry was perfectly accurate, written with a cold, clinical precision my own anxious scrawls lacked. It was me, but a detached version of me. A recording. A transcript of my life.\n\nThe fear curdled into a cold knot in my stomach. I started hiding the journal in different places—under the mattress, in the oven (I don't bake), at the bottom of the laundry basket. It didn't matter. The next entry would always be there, waiting.\n\nLast night, I broke. I snatched the book from its hiding spot in the freezer, my hands trembling. I had to know. I flipped to the latest entry, dated for today.\n\nIt described my morning with its usual chilling accuracy: the burnt toast, the missed bus, the frustrating meeting.\n\nThen I saw the last line. The words were written in a sharper, more deliberate script, the pen pressed so hard it had nearly torn the page.\n\n\"Your methods of hiding me are becoming tedious. Tomorrow, I think I'll try something new. Let's see how you like being the one who just watches.\"\n\nI dropped the journal as if it had burned me. It's still sitting on my coffee table. I can't bring myself to touch it again.\n\nBut a worse thought is forming, one that has frozen the blood in my veins.\n\nIf it can write my past… what's to stop it from writing my future?",
        "video": "https://youtube.com/shorts/ItZlGnUEvuw?feature=share"
    }
]
