[
    {
        "id": "video_00001",
        "title": "The Midnight Subscriber: My Biggest Fan is Always Watching",
        "content": ' It started as a fluke, a happy accident. I created "Chilling Tales," a YouTube channel for my scary stories, as a creative outlet. For six months, it was a ghost town. Then, I got my first consistent viewer: **user78412_.

He—I assumed it was a he—was my sole, loyal audience. No matter when I uploaded, whether it was 7 PM on a Tuesday or 2 PM on a Saturday, his comment was always the first. Always the same: "First! Another great one." It was comforting. My digital patron saint.

The pattern shifted about a month ago. The comments started appearing not just quickly, but instantly. I'd hit "publish," refresh the page, and there it was. "First!" I laughed it off, assuming he had notifications set to "all" and was just that dedicated.

Then came the insomnia. The 3 AM wake-ups, mind racing, staring at the ceiling. One of those nights, an idea, dark and twisted, flowed out of me. I wrote, recorded, and edited a short, raw story about a man who felt a presence in his home every night at 3: 33 AM. On a whim, I uploaded it. The timestamp read 3: 33 AM.

I leaned back, rubbing my eyes, the silence of the house pressing in. I clicked refresh on the video page, expecting nothing. A glitch. A zero in the comment section.

But there it was. A comment from **user78412_, posted just 10 seconds after the video went live.

My blood went cold. It was impossible. No one is that fast.

I clicked on it. The comment wasn't "First!" this time.

It read: "I'm so glad you're finally awake. I can see you much better now."

A jolt of pure ice shot down my spine. My eyes darted from my phone screen to the dark hallway beyond my bedroom door. It was a joke. It had to be. A sick, coincidental joke.

I slammed my laptop shut, my heart hammering against my ribs like a trapped bird. I told myself I was being paranoid, spooked by my own story. I spent the rest of the night with the lights on, jumping at every creak of the old house.

The next morning, in the safe, rational light of day, I checked the comment again. Maybe I had misread it. But it was still there, digital proof of the impossible.

I clicked on **user78412_'s profile. It was empty, save for a single, unlisted playlist. My hand trembled as I clicked it.

The playlist was titled "For You." It contained every video I had ever posted, but the thumbnails were different. They weren't screenshots from my videos. They were photos. Blurry, dark, but unmistakable.

A photo of me at my desk, taken from outside my window.
A photo of the back of my head in a coffee shop last week.
The final video in the playlist was uploaded just an hour ago. The thumbnail was a live feed.

It was a view of my own bedroom, from the corner near the closet. And in the bed, bathed in the blue glow of my phone, was me, staring back in wide-eyed horror.
 ',
        "video youtube link": "https://youtube.com/shorts/tpgQLBVHiDU?feature=share"
    },
]
