[
    {
        "id": "video_00001",
        "title": "The Midnight Subscriber: My Biggest Fan is Always Watching",
        "content": "It started as a fluke, a happy accident. I created \"Chilling Tales,\" a YouTube channel for my scary stories, as a creative outlet. For six months, it was a ghost town. Then, I got my first consistent viewer: **user78412_.\n\nHe—I assumed it was a he—was my sole, loyal audience. No matter when I uploaded, whether it was 7 PM on a Tuesday or 2 PM on a Saturday, his comment was always the first. Always the same: \"First! Another great one.\" It was comforting. My digital patron saint.\n\nThe pattern shifted about a month ago. The comments started appearing not just quickly, but instantly. I'd hit \"publish,\" refresh the page, and there it was. \"First!\" I laughed it off, assuming he had notifications set to \"all\" and was just that dedicated.\n\nThen came the insomnia. The 3 AM wake-ups, mind racing, staring at the ceiling. One of those nights, an idea, dark and twisted, flowed out of me. I wrote, recorded, and edited a short, raw story about a man who felt a presence in his home every night at 3:33 AM. On a whim, I uploaded it. The timestamp read 3:33 AM.\n\nI leaned back, rubbing my eyes, the silence of the house pressing in. I clicked refresh on the video page, expecting nothing. A glitch. A zero in the comment section.\n\nBut there it was. A comment from **user78412_, posted just 10 seconds after the video went live.\n\nMy blood went cold. It was impossible. No one is that fast.\n\nI clicked on it. The comment wasn't \"First!\" this time.\n\nIt read: \"I'm so glad you're finally awake. I can see you much better now.\"\n\nA jolt of pure ice shot down my spine. My eyes darted from my phone screen to the dark hallway beyond my bedroom door. It was a joke. It had to be. A sick, coincidental joke.\n\nI slammed my laptop shut, my heart hammering against my ribs like a trapped bird. I told myself I was being paranoid, spooked by my own story. I spent the rest of the night with the lights on, jumping at every creak of the old house.\n\nThe next morning, in the safe, rational light of day, I checked the comment again. Maybe I had misread it. But it was still there, digital proof of the impossible.\n\nI clicked on **user78412_'s profile. It was empty, save for a single, unlisted playlist. My hand trembled as I clicked it.\n\nThe playlist was titled \"For You.\" It contained every video I had ever posted, but the thumbnails were different. They weren't screenshots from my videos. They were photos. Blurry, dark, but unmistakable.\n\nA photo of me at my desk, taken from outside my window.\nA photo of the back of my head in a coffee shop last week.\nThe final video in the playlist was uploaded just an hour ago. The thumbnail was a live feed.\n\nIt was a view of my own bedroom, from the corner near the closet. And in the bed, bathed in the blue glow of my phone, was me, staring back in wide-eyed horror.",
        "video": "https://youtube.com/shorts/tpgQLBVHiDU?feature=share"
    },
    {
        "id": "video_00002",
        "title": "My Baby Monitor Whispered Back | A True Horror Story",
        "content": "It started with the laughter.\n\nMy wife, Sarah, and I laughed it off at first. 'It's just static,' I'd say, 'or a signal from a neighbor's monitor.' We were new parents, exhausted and prone to hearing things. But the sound that came through the baby monitor every night around 2 AM wasn't static. It was the distinct, gurgling giggle of a toddler. Our daughter, Lily, was only six months old. She didn't laugh like that yet. She certainly didn't do it in her sleep.\n\nWe’d rush into her room, our hearts thumping, only to find her peacefully asleep, her chest rising and falling in a perfect, innocent rhythm. The monitor on our nightstand, however, would continue to pick up the soft laughter, sometimes followed by a faint, rhythmic shuffling, like tiny feet on the crib mattress.\n\nWe changed the monitor. We changed the frequency. Nothing worked. The laughter was just… there.\n\nThe dread became a third occupant in our house, a cold presence that settled in as the sun went down. We stopped talking about it. Acknowledging it felt like giving it power.\n\nThen, last night, everything changed.\n\nI was jolted awake not by laughter, but by a deafening silence. The monitor was dead quiet. No static, no ambient room noise. Just a void. I squinted at the video feed. The night-vision glow showed Lily, still asleep.\n\nThen, a shadow detached itself from the corner of the room, a deeper blackness in the dark. It was tall, impossibly so, and thin. It didn't walk so much as it *unfolded* itself toward the crib. My blood turned to ice. I tried to scream, to move, but I was paralyzed, locked in a nightmare while wide awake.\n\nThe figure leaned over the crib, its head tilting. And from the monitor, the laughter returned, but this time it was low, wet, and cruel.\n\nThe figure straightened up. And then, it turned. It didn't have a face, just a smooth, pale oval where features should be. It was looking directly at the camera. At *me*.\n\nOn the screen, my sleeping daughter suddenly sat bolt upright. Her eyes were wide open, black and depthless in the green light. She turned her head, not toward the figure, but directly into the lens of the monitor.\n\nThe monitor speaker crackled, and a voice that was not a child's, a voice that was ancient and rasping and wrong, whispered clearly:\n\n'Shhh, you'll wake the other one.'\n\nThe screen went black.\n\nI found myself in Lily's room, I don't even remember moving. I was clutching her, sobbing, as Sarah flicked on the light. The room was empty. Lily was fine, crying now from being woken so abruptly.\n\nWe both told ourselves it was a shared nightmare, a hallucination born of sleep deprivation. We almost believed it.\n\nUntil this morning.\n\nI was getting ready for work, my hands still shaking, when I passed the nursery. The door was ajar. I glanced in, and my heart stopped.\n\nIn the far corner of the room, the one where the shadow had first appeared, sat Lily’s favorite stuffed rabbit. It was propped up against the wall. And tucked under its arm was a second, identical stuffed rabbit. One we had never owned before.",
        "video": "https://youtube.com/shorts/Ziaq38ubC3A?feature=share"
    }
]
