[
    {
        "id": "video_00001",
        "title": "The Midnight Subscriber: My Biggest Fan is Always Watching",
        "content": "It started as a fluke, a happy accident. I created \"Chilling Tales,\" a YouTube channel for my scary stories, as a creative outlet. For six months, it was a ghost town. Then, I got my first consistent viewer: **user78412_.\n\nHe—I assumed it was a he—was my sole, loyal audience. No matter when I uploaded, whether it was 7 PM on a Tuesday or 2 PM on a Saturday, his comment was always the first. Always the same: \"First! Another great one.\" It was comforting. My digital patron saint.\n\nThe pattern shifted about a month ago. The comments started appearing not just quickly, but instantly. I'd hit \"publish,\" refresh the page, and there it was. \"First!\" I laughed it off, assuming he had notifications set to \"all\" and was just that dedicated.\n\nThen came the insomnia. The 3 AM wake-ups, mind racing, staring at the ceiling. One of those nights, an idea, dark and twisted, flowed out of me. I wrote, recorded, and edited a short, raw story about a man who felt a presence in his home every night at 3:33 AM. On a whim, I uploaded it. The timestamp read 3:33 AM.\n\nI leaned back, rubbing my eyes, the silence of the house pressing in. I clicked refresh on the video page, expecting nothing. A glitch. A zero in the comment section.\n\nBut there it was. A comment from **user78412_, posted just 10 seconds after the video went live.\n\nMy blood went cold. It was impossible. No one is that fast.\n\nI clicked on it. The comment wasn't \"First!\" this time.\n\nIt read: \"I'm so glad you're finally awake. I can see you much better now.\"\n\nA jolt of pure ice shot down my spine. My eyes darted from my phone screen to the dark hallway beyond my bedroom door. It was a joke. It had to be. A sick, coincidental joke.\n\nI slammed my laptop shut, my heart hammering against my ribs like a trapped bird. I told myself I was being paranoid, spooked by my own story. I spent the rest of the night with the lights on, jumping at every creak of the old house.\n\nThe next morning, in the safe, rational light of day, I checked the comment again. Maybe I had misread it. But it was still there, digital proof of the impossible.\n\nI clicked on **user78412_'s profile. It was empty, save for a single, unlisted playlist. My hand trembled as I clicked it.\n\nThe playlist was titled \"For You.\" It contained every video I had ever posted, but the thumbnails were different. They weren't screenshots from my videos. They were photos. Blurry, dark, but unmistakable.\n\nA photo of me at my desk, taken from outside my window.\nA photo of the back of my head in a coffee shop last week.\nThe final video in the playlist was uploaded just an hour ago. The thumbnail was a live feed.\n\nIt was a view of my own bedroom, from the corner near the closet. And in the bed, bathed in the blue glow of my phone, was me, staring back in wide-eyed horror.",
        "video": "https://youtube.com/shorts/tpgQLBVHiDU?feature=share"
    },
    {
        "id": "video_00002",
        "title": "My Baby Monitor Whispered Back | A True Horror Story",
        "content": "It started with the laughter.\n\nMy wife, Sarah, and I laughed it off at first. 'It's just static,' I'd say, 'or a signal from a neighbor's monitor.' We were new parents, exhausted and prone to hearing things. But the sound that came through the baby monitor every night around 2 AM wasn't static. It was the distinct, gurgling giggle of a toddler. Our daughter, Lily, was only six months old. She didn't laugh like that yet. She certainly didn't do it in her sleep.\n\nWe’d rush into her room, our hearts thumping, only to find her peacefully asleep, her chest rising and falling in a perfect, innocent rhythm. The monitor on our nightstand, however, would continue to pick up the soft laughter, sometimes followed by a faint, rhythmic shuffling, like tiny feet on the crib mattress.\n\nWe changed the monitor. We changed the frequency. Nothing worked. The laughter was just… there.\n\nThe dread became a third occupant in our house, a cold presence that settled in as the sun went down. We stopped talking about it. Acknowledging it felt like giving it power.\n\nThen, last night, everything changed.\n\nI was jolted awake not by laughter, but by a deafening silence. The monitor was dead quiet. No static, no ambient room noise. Just a void. I squinted at the video feed. The night-vision glow showed Lily, still asleep.\n\nThen, a shadow detached itself from the corner of the room, a deeper blackness in the dark. It was tall, impossibly so, and thin. It didn't walk so much as it *unfolded* itself toward the crib. My blood turned to ice. I tried to scream, to move, but I was paralyzed, locked in a nightmare while wide awake.\n\nThe figure leaned over the crib, its head tilting. And from the monitor, the laughter returned, but this time it was low, wet, and cruel.\n\nThe figure straightened up. And then, it turned. It didn't have a face, just a smooth, pale oval where features should be. It was looking directly at the camera. At *me*.\n\nOn the screen, my sleeping daughter suddenly sat bolt upright. Her eyes were wide open, black and depthless in the green light. She turned her head, not toward the figure, but directly into the lens of the monitor.\n\nThe monitor speaker crackled, and a voice that was not a child's, a voice that was ancient and rasping and wrong, whispered clearly:\n\n'Shhh, you'll wake the other one.'\n\nThe screen went black.\n\nI found myself in Lily's room, I don't even remember moving. I was clutching her, sobbing, as Sarah flicked on the light. The room was empty. Lily was fine, crying now from being woken so abruptly.\n\nWe both told ourselves it was a shared nightmare, a hallucination born of sleep deprivation. We almost believed it.\n\nUntil this morning.\n\nI was getting ready for work, my hands still shaking, when I passed the nursery. The door was ajar. I glanced in, and my heart stopped.\n\nIn the far corner of the room, the one where the shadow had first appeared, sat Lily’s favorite stuffed rabbit. It was propped up against the wall. And tucked under its arm was a second, identical stuffed rabbit. One we had never owned before.",
        "video": "https://youtube.com/shorts/Ziaq38ubC3A?feature=share"
    },
    {
        "id": "video_00003",
        "title": "The Doppelgänger Diary: I Found a Journal Entry I Didn't Write",
        "content": "I started the journal to quiet the noise in my head. My therapist suggested it for my anxiety—a place to dump all the circling thoughts so I could finally sleep. I bought a simple, black Moleskine. It felt solid, real. An anchor in the fog of my own mind.\n\nThe first week was cathartic. I wrote about work stress, about an awkward conversation with a neighbor, about my fear that my life was plateauing. It was mundane, but it was mine.\n\nThe first strange entry appeared on a Tuesday.\n\nI opened the journal to a fresh page, and my breath hitched. There, in my own unmistakable handwriting, was a detailed account of my previous day.\n\n\"Monday. Cloudy. Went to work, came home, ordered Thai food. The Panang curry was too sweet. Watched two episodes of that detective show, the one where you guessed the killer in the first ten minutes. You felt bored. You went to bed at 11:07 PM.\"\n\nIt was all correct. Eerily so. But I had no memory of writing it. I convinced myself I must have been half-asleep, just disoriented from the new routine. I shook it off, wrote my actual entry for the day, and tried to forget.\n\nBut it happened again the next week. And the week after that. Each time, the entry was perfectly accurate, written with a cold, clinical precision my own anxious scrawls lacked. It was me, but a detached version of me. A recording. A transcript of my life.\n\nThe fear curdled into a cold knot in my stomach. I started hiding the journal in different places—under the mattress, in the oven (I don't bake), at the bottom of the laundry basket. It didn't matter. The next entry would always be there, waiting.\n\nLast night, I broke. I snatched the book from its hiding spot in the freezer, my hands trembling. I had to know. I flipped to the latest entry, dated for today.\n\nIt described my morning with its usual chilling accuracy: the burnt toast, the missed bus, the frustrating meeting.\n\nThen I saw the last line. The words were written in a sharper, more deliberate script, the pen pressed so hard it had nearly torn the page.\n\n\"Your methods of hiding me are becoming tedious. Tomorrow, I think I'll try something new. Let's see how you like being the one who just watches.\"\n\nI dropped the journal as if it had burned me. It's still sitting on my coffee table. I can't bring myself to touch it again.\n\nBut a worse thought is forming, one that has frozen the blood in my veins.\n\nIf it can write my past… what's to stop it from writing my future?",
        "video": "https://youtube.com/shorts/ItZlGnUEvuw?feature=share"
    },
    {
        "id": "video_00004",
        "title": "I Opened My Grandmother's Forbidden Drawer. I Shouldn't Have.",
        "content": "My grandmother was the kindest soul I knew, but she had one ironclad rule, delivered with a fear I never understood: 'Never, ever open the bottom drawer of the heirloom dresser.'\n\nFor years, I obeyed. After she passed, the dresser was my only inheritance. I moved the heavy, oak monster into my city apartment. For a month, it was just a piece of furniture.\n\nThen the scratching started.\n\nIt began at 3 AM. A soft, rhythmic *scritch... scritch... scritch* from the bottom drawer. It wasn't mice. It was patient. Deliberate. It sounded like fingernails.\n\nNight after night, it wore me down. I couldn't sleep. The air in my room grew cold. Shadows seemed to cling to the dresser.\n\nLast night, I snapped.\n\nDriven by sleepless rage, I knelt before the drawer. 'Never,' her voice echoed in my memory. I ignored it. I grabbed the brass pull and pulled with all my might.\n\nThe drawer didn't open. It was locked, or held fast by something on the inside.\n\nThe scratching stopped. The silence was deafening.\n\nThen, a new sound came from within the wood. A soft, wet click, followed by a whisper that seeped into my bones:\n\n'Thank you,' it breathed. 'I was so hungry.'\n\nI scrambled back, my heart hammering. And as I stared, the top drawer—the one where I keep my socks—gently slid open, all on its own.",
        "video": "https://youtube.com/shorts/9OoALpaADAI?feature=share"
    },
    {
        "id": "video_00005",
        "title": "The GPS Told Me To Take The Faster Route... I Shouldn't Have.",
        "content": "It's funny how a single, automated voice can unravel your entire reality. We trust them implicitly, these little black mirrors that guide our lives. But what happens when the map has a mind of its own? This is what happened to me last Tuesday. I haven't driven since.\n\n---\n\nThe rain was coming down in thick, oily sheets, smearing the taillights of the cars ahead of me into hellish watercolors. I was exhausted, the kind of deep weariness that seeps into your bones after a 12-hour shift. All I wanted was my couch, a warm blanket, and the mindless glow of the television.\n\nMy phone was mounted on the dash, Google Maps calmly displaying a solid red line of traffic. A 45-minute standstill. I groaned, thumping my head back against the rest.\n\nThat's when it happened.\n\nThe screen flickered, not like a bad connection, but like a slow, deliberate blink. The cheerful blue path vanished, and for a second, the map was just a blank, black square. My heart did a little stutter-step. Then, a new route materialized in a sickly, pus-yellow color I'd never seen the app use before. It snaked down a side road I'd never noticed, bypassing the congestion entirely.\n\nA new voice came through my car's speakers. It was still female, still robotic, but the cadence was wrong. The pauses were in places that felt... organic.\n\n\"Recalculating,\" it stated, the word drawn out. \"Heavy traffic detected on your current route. Avoid delay... by taking the faster route.\"\n\nRelief washed over me. A glitch, sure, but a helpful one. \"Okay, Google,\" I mumbled, too tired to question my digital savior. \"Let's do it.\"\n\nI took the next exit, my tires crunching onto gravel that quickly turned to hard-packed dirt. The trees on either side of the road seemed to lean in, their branches clawing at the sky, blocking out the last vestiges of the city's ambient light. The world outside my headlights shrunk to a small, jittering circle of reality.\n\nThe GPS screen flickered again. \"Turn left in five hundred feet,\" the voice instructed.\n\nThere was no left. Just a solid wall of pine trees. I slowed the car to a crawl, peering into the oppressive darkness. \"Recalculate,\" I said, my voice sounding thin and small.\n\n\"Turn left,\" the voice repeated, and this time, I heard it. A hint of impatience. A sliver of emotion.\n\nSwallowing hard, I inched forward. And then I saw it: a gap in the trees so narrow I'd have missed it if I'd blinked. An old, overgrown logging trail. I turned, the branches scraping against my car like long, bony fingers.\n\nThe voice was silent for ten minutes, the yellow line my only guide deeper into the woods. The silence was worse. It was a heavy, listening silence.\n\nThen, it spoke again, but the volume was lower, as if sharing a secret.\n\n\"You are making good time,\" it whispered. The sound was so quiet I had to strain to hear it over the rain and the engine. A cold knot tightened in my stomach.\n\nHow could it know? There was no GPS signal out here. No cell service. The map on my screen was now a static image, the yellow line frozen.\n\n\"They have been waiting for you,\" the voice whispered, even softer now, almost intimate.\n\nMy blood ran cold. \"Who?\" I breathed out, not expecting an answer.\n\nThe screen of my phone didn't just flicker this time. It died completely, plunging me into absolute blackness. I slammed on the brakes, my heart hammering against my ribs. I fumbled for the phone, pressing the power button. Nothing.\n\nTerrified, I threw the car into reverse, intending to back out the way I came. My headlights swept across the forest as I turned.\n\nAnd that's when I saw them.\n\nSilhouettes. Dozens of them. Standing perfectly still between the trees. Tall, impossibly thin figures, their forms barely distinguishable from the dark trunks. They weren't moving. They were just... waiting. Staring at my car.\n\nI didn't breathe. I didn't think. I shoved the car into drive and slammed my foot on the accelerator, hurtling forward down the dark path, blind and praying it led somewhere, anywhere, but here.\n\nAfter what felt like an eternity, I saw a faint glow in the distance. I burst out of the treeline onto a paved road, the streetlights a blinding, beautiful relief. I didn't stop until I was safely inside my garage, doors locked, huddled and shaking.\n\nThe police found my car the next day, miles away, abandoned on the side of a highway. They said I must have fallen asleep at the wheel. They couldn't explain the deep, parallel scratches along both sides of the car, or the handprints-small, child-sized, and caked with mud-pressed against the inside of the rear windshield.\n\nMy phone was on the passenger seat, completely dead. When I finally got it to charge again later that night, Google Maps automatically opened.\n\nThe screen was normal. The traffic was clear.\n\nAnd in the search bar, typed out as if by an invisible hand, were two words:\n\nWelcome home.",
        "video": "https://youtube.com/shorts/h2BYuvVDsbY?feature=share"
    },
    {
        "id": "video_00006",
        "title": "The Midnight Memo: One of Them Is Still In Here With You",
        "content": "The clatter of the keys hitting the laminate counter was the official handover of power. It was the sound that meant I was now the sole guardian of this sprawling, silent office complex for the next eight hours.\n\n'Quiet one, Mike,' Frank, the day guard, said with his usual tired smile. He tapped the standard-issue logbook. 'Left you a note. AC in the west wing's making that gurgling noise again.'\n\nI nodded, slinging my lunch bag into the bottom drawer of the security desk. 'Same old, same old. Get home safe, Frank.'\n\nHe gave a half-salute and disappeared into the elevator, the *ding* of its descent the final note of the day shift. Silence descended, thick and heavy. I poured my first coffee of the night and opened the logbook.\n\nFrank's notes were always the same. '*Front door left ajar at 14:30, resolved.*' '*Flickering light in men's restroom, 3rd floor, put in maintenance ticket.*' Mundane, bureaucratic ghosts he'd chased away before passing the baton to me.\n\nBut tonight's note was different.\n\nThe script wasn't Frank's neat, all-caps print. It was a frantic, jagged scrawl; the pen had dug so deep into the paper it had nearly torn through in places. It looked like it had been written in a hurry, or in terror.\n\nMy eyes narrowed as I read it.\n\n*'Mike –\nFinal headcount at 5:00 PM. I watched them all leave. I counted 12 people. I locked the main doors at 5:07. I did a final sweep. Empty. Silent.\nBut when I walked back to the desk to clock out... I heard a cough from the 2nd-floor atrium.\nI didn't see anyone come in. I swear I didn't. But when I counted again... from the security cameras... there were 13.\nOne of them is still in here with you.'*\n\nA cold knot tightened in my stomach. I laughed, a short, dry sound that died quickly in the dead air. Frank's idea of a joke. A sick, midnight shift joke. He was trying to spook the new guy. It had to be.\n\nI took a gulp of coffee, the bitterness doing little to steady my nerves. My eyes were drawn against my will to the bank of security monitors. Twelve screens showed twelve slices of the building in grainy monochrome. Empty hallways. A dark cafeteria. Vacant cubicles.\n\nAll empty.\n\n*He's messing with you,* I told myself. *He's probably at home laughing right now.*\n\nI forced myself to do my first rounds, my footsteps echoing unnaturally loud. Every shadow seemed to hold its breath. Every hum of the building's infrastructure sounded like a whispered conversation just around the corner. I found myself counting my own steps, a stupid, superstitious rhythm.\n\nWhen I got back to the desk, my heart was thumping. I slumped into the chair and stared at the monitors.\n\nNothing.\n\nI let out a breath I didn't realize I'd been holding. Frank's joke had worked, I'd give him that. I was officially spooked. I reached for my coffee mug, my eyes still glued to the screens.\n\nAnd then I saw it.\n\nOn monitor 7, the one for the second-floor atrium—the one Frank had mentioned—a shadow detached itself from behind a large potted plant. It was just a flicker of movement, there and then gone.\n\nMy blood ran cold.\n\n*It's a trick of the light. A glitch in the old camera.*\n\nI leaned forward, my nose almost touching the screen, my pulse a frantic drum in my ears. I started counting the figures I could see on the monitors. The janitor's cart on 1. The silhouette of a coat rack on 3. Anything that could be misconstrued as a person.\n\nOne... two... three...\n\nIt was a pointless, paranoid exercise. But I couldn't stop.\n\n...eight... nine... ten...\n\nMy eyes darted from screen to screen. The knot in my stomach was ice.\n\nEleven.\n\nI counted again. Eleven. Always eleven.\n\n*See?* I thought, a hysterical laugh bubbling in my throat. *There's no one. It's just you and your imagination.*\n\nJust as I was about to look away, a soft, metallic *scratch* echoed from the elevator shaft directly behind me.\n\nI froze.\n\nSlowly, painfully slowly, I turned my head.\n\nThe elevator's floor indicator, which had been dormant on 'G' for hours, was now lit up.\n\nIt was on the second floor.\n\nAnd as I watched, paralyzed, the number began to descend.\n\n*2...*\n\n*1...*\n\n*G...*\n\nThe soft, mechanical *ding* sliced through the silence like a knife.",
        "video": "https://youtube.com/shorts/fC28r22IFVQ?feature=share"
    },
    {
        "id": "video_00007",
        "title": "My Toddler's Creepy Song Had A Hidden Message",
        "content": "Parenthood is a symphony of weird noises. Giggles, coos, and the pitter-patter of tiny feet. But lately, the soundtrack to my life has included a new, unsettling sound: my two-year-old son, Leo, has started humming a song.\n\nIt's not 'Twinkle Twinkle' or 'The Wheels on the Bus.' It's a discordant, meandering tune that always seems to be in a minor key. There are no words, just a low, off-key hum that he'll sustain for minutes at a time, usually while staring at a blank corner of the room. It sets my teeth on edge.\n\n'Where did he learn that?' my wife asked, a slight frown on her face.\n\n'I have no idea,' I replied. 'Maybe from a weird cartoon?'\n\nWe checked his shows. We asked at daycare. Nothing. The song was his and his alone.\n\nLast night, it got worse. I was putting him to bed, and he started the humming just as I turned off the main light, leaving only the galaxy projector casting stars on the ceiling. In the semi-darkness, the tune didn't just sound eerie; it felt *wrong*. It was the kind of sound that makes the hair on your arms stand up.\n\nFrustrated and a little spooked, I did what any modern parent would do: I pulled out my phone. I opened my voice memo app, held it up, and recorded about thirty seconds of his soft, monotonous humming.\n\n'Maybe we can Shazam it or something,' I muttered to myself, leaving the room as Leo finally drifted to sleep.\n\nLater, with a cup of tea in hand, I played the recording back. It was just as creepy the second time. Shazam came up with nothing. On a whim, remembering old stories about 'backmasking' in rock songs, I opened a simple audio editing app. I found a function to 'Reverse' the clip. I tapped it.\n\nThe garbled, high-pitched sound that came out first was nonsensical. But then, as the app smoothed the audio, it became clear. Chillingly clear.\n\nThe reversed hum resolved into a raspy, guttural whisper. A voice that was most certainly not my son's.\n\nIt spoke two words, slow and deliberate:\n\n'Behind you.'\n\nA jolt of ice shot down my spine. My breath caught in my throat. I was too afraid to turn around, too afraid to look at the dark hallway leading to my son's room. Because in the silence of the house, I could just barely make it out—the soft, off-key sound of humming, starting up once more.",
        "video": "https://youtube.com/shorts/vndg_2PQ2Os?feature=share"
    },
    {
        "id": "video_00008",
        "title": "The Sleepover Rule My Child Gave Mr. Talls",
        "content": "The thing about parenthood is you learn to play along. You clap for invisible tea parties and have heartfelt conversations with stuffed elephants. So, when my four-year-old, Lily, started talking about \"Mr. Talls,\" I didn't think twice.\n\n\"He's very nice, Mommy,\" she'd say, pointing at an empty corner of her room. \"And he's skinny. Like a tree.\"\n\nIt was cute. Until the sleepover was announced.\n\n\"Mr. Talls is coming to stay tonight,\" Lily declared at dinner, her face serious.\n\n\"Oh, is he?\" I smiled, wiping spaghetti sauce from her chin. \"And what are the rules for this sleepover?\"\n\nLily held up a chubby finger. \"One,\" she said, her voice dropping to a whisper. \"You have to leave the closet door open. All the way open.\"\n\nI nodded, playing my part. \"Okay. So he can get his pajamas?\"\n\nShe held up a second finger. \"Two. A glass of water on the nightstand. Not for me. For him.\"\n\nA slight chill trickled down my spine. That was... specific. \"Is Mr. Talls thirsty?\"\n\nShe ignored me and raised a third finger, her eyes wide and unblinking. \"Three. You have to say 'goodnight' to the corner. The dark corner. And you have to *mean it*.\"\n\nThat night, the game felt less cute. The setting sun cast long shadows across the hallway, and Lily's room seemed darker than usual. But I was a rational adult. I was humoring my daughter's imagination. So, I did it.\n\nI left the closet door yawning open, a black rectangle in the pale yellow wall. I placed a full glass of water on her nightstand. And finally, feeling utterly ridiculous, I looked into the dark corner where her rocking chair sat.\n\n\"Goodnight, Mr. Talls,\" I said, trying to inject sincerity into my voice. It came out as a strained whisper.\n\nLily, already tucked in, gave a solemn nod of approval. \"He likes it.\"\n\nI kissed her forehead, turned on her night light, and closed her door most of the way, leaving just a crack—my own rule.\n\nI slept fitfully. The house was too quiet, the kind of silence that feels like it's holding its breath. At 2:17 AM, a sharp *crack* jolted me awake. It sounded like wood splitting.\n\nMy heart hammered against my ribs as I slipped out of bed and crept to Lily's door. I peered through the crack.\n\nThe room was bathed in the soft glow of the night light. The glass of water on the nightstand was empty. And the rocking chair in the dark corner was moving, rocking back and forth with a slow, rhythmic *creak*.\n\nBut it was empty.\n\nA cold dread, thick and suffocating, washed over me. My eyes darted to Lily's bed. She was sleeping peacefully.\n\nThen, a voice, dry as fallen leaves and impossibly deep, whispered from the darkness of the open closet. It wasn't coming from the rocking chair.\n\n\"You said goodnight to the wrong corner.\"",
        "video": "https://youtube.com/shorts/TOHZx0Sn6j8?feature=share"
    },
    {
        "id": "video_00009",
        "title": "The Midnight FM: A Driving Horror Story",
        "content": "You know that bleary-eyed feeling, the one you get after a long day that bled into an even longer night? That was me, white-knuckling the steering wheel at 1:37 AM on a stretch of highway so dark it felt like driving through a void. The only light was the sickly green glow from my dashboard, and the only sound was the static hiss of dead air on the radio.\n\nI thumbed the scan button, desperate for anything to keep me company, to keep me awake. Through the crackle and pop, a clear signal cut through. A song. Not just any song—it was \"You Are My Sunshine,\" the same lullaby my grandmother sang to me every night when I was a child. A wave of warm, uneasy nostalgia washed over me. How was this possible? Out here?\n\nThe song faded, and a DJ came on, his voice like smoothed-over velvet. \"A beautiful classic for a lonely night on the road. That was for you, Sarah.\"\n\nMy blood ran cold. My name. He said my name.\n\nI gripped the wheel tighter, my heart hammering against my ribs. *A coincidence,* I told myself. *There's another Sarah listening out here.* I tried to laugh it off, but the sound caught in my throat.\n\nThe DJ's voice returned, lower now, almost a whisper. \"You look tired, Sarah. Those long drives home are a killer, aren't they? Don't worry. I've got the perfect shortcut for you.\"\n\nMy GPS screen, which had been steadily guiding me home, flickered and went black for a second. When it rebooted, it was recalculating. The new route was highlighted in angry red, veering off onto an exit I'd never noticed before.\n\n\"*Recalculating,*\" the robotic GPS voice intoned. \"*In 500 feet, take the exit onto Blackwood Lane.*\"\n\nBlackwood Lane? I'd lived here my whole life and had never heard of it. As if reading my mind, the DJ crooned, \"It's a new road, Sarah. Very exclusive. Just for you. Take the exit.\"\n\nMy hands were shaking. I should have turned the radio off. I should have pulled over. But a morbid, frozen curiosity kept me going. I signaled, my blinker unnaturally loud in the silence, and took the exit onto a narrow, unpaved road swallowed by dense trees.\n\nThe velvet voice was back, but it was changing, distorting as if the signal was struggling. \"*That's it... good girl. Just a little further now.*\"\n\nI chanced a look in my rearview mirror. My high beams reflected off the grille of a large, black sedan. It was two cars back, its headlights like two unwavering eyes. How long had it been there? I hadn't seen another car for miles.\n\nThe DJ's voice crackled, now a harsh, digital whisper that seemed to come from both the speakers and the back of my own skull.\n\n\"*Almost home, Sarah.*\"\n\nA staticky pause, then the final, gut-wrenching words.\n\n\"*They've been waiting.*\"\n\nThe radio died. The GPS screen went dark. I slammed on the brakes, my car skidding to a halt in the middle of that godforsaken road. I whipped my head around, terrified to look, but needing to see.\n\nThe road behind me was empty. The black sedan was gone.\n\nBut from the impenetrable woods on either side, I could have sworn I saw the faint, slow blink of a single pair of eyes. Then another. And another.",
        "video": "https://youtube.com/shorts/YWjdxohcxIc?feature=share"
    }
]
